In [6]:
import pandas as pd

In [9]:
df = pd.read_csv("online.csv")

In [10]:
df.head()

,Unnamed: 0,order_status,Monthly Income,latitude,Marital Status,Gender,employment_status,Family size,Reviews,Pin code,Age,longitude,Educational Qualifications,Unnamed: 13,9,#@%
0,0,Yes,25001 to 50000,13.0262,Married,Male,Employee,5.0,Positive,560045,28.0,77.6200,Post Graduate,Yes,NaN,swiggyscount
1,1,Yes,No Income,12.9770,Single,Male,Student,NaN,Positive,560009,NaN,77.5773,Post Graduate,Yes,NaN,*7435
2,2,Yes,No Income,12.9770,Single,Female,Student,NaN,Positive,560009,NaN,77.5773,Post Graduate,Yes,NaN,*7435
3,3,Yes,No Income,13.0019,Single,Female,Student,NaN,Positive,560003,NaN,77.5713,Post Graduate,Yes,NaN,*7435
4,4,Yes,More than 50000,13.0626,Married,Male,Self Employeed,NaN,Positive,560015,NaN,77.5284,School,Yes,NaN,*7435

In [11]:
df.shape

(388, 16)

In [12]:
df.columns

Index(['Unnamed: 0', 'order_status', 'Monthly Income', 'latitude',
       'Marital Status', 'Gender', 'employment_status', 'Family size',
       'Reviews', 'Pin code', 'Age', 'longitude', 'Educational Qualifications',
       'Unnamed: 13', '9', '#@%'],
      dtype='object')

In [15]:
df.isnull().sum()

Unnamed: 0                      0
order_status                    0
Monthly Income                  0
latitude                        0
Marital Status                  0
Gender                          0
employment_status               0
Family size                    19
Reviews                         0
Pin code                        0
Age                            19
longitude                       0
Educational Qualifications      0
Unnamed: 13                     0
9                             388
#@%                           382
dtype: int64

In [16]:
df.shape

(388, 16)

In [17]:
df.isnull().sum()

Unnamed: 0                      0
order_status                    0
Monthly Income                  0
latitude                        0
Marital Status                  0
Gender                          0
employment_status               0
Family size                    19
Reviews                         0
Pin code                        0
Age                            19
longitude                       0
Educational Qualifications      0
Unnamed: 13                     0
9                             388
#@%                           382
dtype: int64

In [18]:
q1 = int(df.describe()["Age"]["25%"])

In [19]:
df.describe()

,Unnamed: 0,latitude,Family size,Pin code,Age,longitude,9
count,388.000000,388.000000,369.000000,388.000000,369.000000,388.000000,0.0
mean,193.500000,12.972058,3.298103,560040.113402,24.666667,77.600160,NaN
std,112.150197,0.044489,1.354550,31.399609,2.968128,0.051354,NaN
min,0.000000,12.865200,1.000000,560001.000000,18.000000,77.484200,NaN
25%,96.750000,12.936900,2.000000,560010.750000,23.000000,77.565275,NaN
50%,193.500000,12.977000,3.000000,560033.500000,24.000000,77.592100,NaN
75%,290.250000,12.997025,4.000000,560068.000000,26.000000,77.630900,NaN
max,387.000000,13.102000,6.000000,560109.000000,33.000000,77.758200,NaN

In [21]:
family_mean=int(df["Family size"].mean())

In [5]:
import seaborn as sns

In [6]:
import pandas as pd

In [4]:
df.head()

NameError: name 'df' is not defined